Avnet-Silica-team/NBIOTBG96SHIELD-Azure-example/Projects/Multi/Applications/Azure_Sns_DM/Src/platform_STM32Cube_NucleoL476RG.c
  /* initialize Real Time Clock */
  InitRTC();

  /* Check if Data stored in BackUp register0: No Need to reconfigure RTC */
  while(HAL_RTCEx_BKUPRead(&TargetBoardFeatures.RtcHandle, RTC_BKP_DR0) != 0x32F2){
    /* Configure RTC Calendar */
    char ipAddress[16]; // "time-d.nist.gov";
    uint8_t tcpPort  =  NTP_ENDPOINT_TCPPORT;
    uint8_t socketHandle;
    uint8_t NumRentryNTP=0;
    static NTP_ENDPOINT NTP_Server=NTP_DEFAULT;
    switch(NTP_Server) {
      case NTP_DEFAULT:
        strcpy(ipAddress, NTP_ENDPOINT_IPADDRESS_DEFAULT);
      break;
      case NTP_BACKUP1:
        strcpy(ipAddress, NTP_ENDPOINT_IPADDRESS_BACKUP1);
      break;
      case NTP_BACKUP2:
        strcpy(ipAddress, NTP_ENDPOINT_IPADDRESS_BACKUP2);
      break;
      default:
        AzureExit(AZURE_ERR_NTP);
    }

    AZURE_PRINTF("Contact NTP server %s \r\n", ipAddress);

    status = wifi_socket_client_open((uint8_t*)ipAddress, tcpPort, (uint8_t*) "t", &socketHandle);
    if(status!=WiFi_MODULE_SUCCESS) {
      AZURE_PRINTF("Err opening socket with NTP server\r\n");
    } else {
      AZURE_PRINTF("WiFi opened socket with NTP server [%s]\r\n",ipAddress);
      NTP_Status = NTP_STATUS_CONNECTED;

      // Wait to receive data and that NTP server closes the Socket
      while(NTP_Status!=NTP_STATUS_CLOSED) {
        HAL_Delay(100);
      }
      AZURE_PRINTF("Socket closed with NTP server\r\n");
      NTP_Status=NTP_STATUS_NULL;
    }

    if(HAL_RTCEx_BKUPRead(&TargetBoardFeatures.RtcHandle, RTC_BKP_DR0) != 0x32F2) {
      // NTP server cannot be queried more frequently than once every 4 seconds
      AZURE_PRINTF("I'll try again to connect to NTP server in 4 seconds\r\n");
      HAL_Delay(4000);
      NumRentryNTP++;
      if (NumRentryNTP == NTP_MAX_RETRIES){
        NumRentryNTP = 0;

        switch(NTP_Server) {
          case NTP_DEFAULT:
            AZURE_PRINTF("NTP backup 1\r\n");
            NTP_Server = NTP_BACKUP1;
          break;
          case NTP_BACKUP1:
            AZURE_PRINTF("NTP backup 2\r\n");
            NTP_Server = NTP_BACKUP2;
          break;
          case NTP_BACKUP2:
            AZURE_PRINTF("NTP Default\r\n");
            NTP_Server = NTP_DEFAULT;
          break;
          default:
            AzureExit(AZURE_ERR_NTP);
        }
      }
    }
  }
  /* RTC Is ok */
  {
    uint8_t aShowTime[50] = {0};
    uint8_t aShowDate[50] = {0};
    RTC_CalendarShow(aShowTime,aShowDate);
    AZURE_PRINTF("Init Real Time Clock %s %s\r\n",aShowDate,aShowTime);
  }

  /* Init the Local Buffer for mbedTLS for Telemetry */
  LocalBufferInit(&localBufferReading[AZURE_SOCKET_TELEMETRY]);
  /* Init the Local Buffer for mbedTLS for Device Management */
  LocalBufferInit(&localBufferReading[AZURE_SOCKET_FOTA]);
  return 0;
}

/**
  * @brief  Function for signaling Error
  * @param  AZURE1_ERROR Value Error Type
  * @retval None
  */
void AzureExit(AZURE1_ERROR Value)
{
  AZURE_PRINTF("\r\nErr Type %s\r\n",ENUM_TO_STRING(AZURE1_ERROR,Value));
  AZURE_PRINTF("\tNecessity to restart the Board\r\n");
  /* Infinite led blinking */
  BSP_LED_Off(LED2);
  while(1) {
    int32_t Counter;
    /* Blinking Error Code... */
    for(Counter=0;Counter<Value;Counter++) {
      BSP_LED_On(LED2);
      HAL_Delay(200);
      BSP_LED_Off(LED2);
      HAL_Delay(400);
    }
    HAL_Delay(4000);
  }
}

/**
  * @brief  Function for starting the timer for sending the Telemetry data to IoT
  * @param  None
  * @retval None
  */
void StartTimer1(void) {
  /* Starting timer */
  if(HAL_TIM_OC_Start_IT(&TimCCHandle, TIM_CHANNEL_1) != HAL_OK){
    /* Starting Error */
    STM32_Error_Handler();
  }

  /* Set the new Capture compare value */
  {
    uint32_t uhCapture = __HAL_TIM_GET_COUNTER(&TimCCHandle);
    /* Set the Capture Compare Register value */
    __HAL_TIM_SET_COMPARE(&TimCCHandle, TIM_CHANNEL_1, (uhCapture + TargetBoardFeatures.TIM_CC1_Pulse));
  }

  AZURE_PRINTF("Channel 1 for Timer 1 started\r\n");
}

/**
  * @brief  Function for pausing the timer for sending the Telemetry data to IoT
  * @param  None
  * @retval None
  */
void StopTimer1(void) {
  /* Stop timer */
  if(HAL_TIM_OC_Stop_IT(&TimCCHandle, TIM_CHANNEL_1) != HAL_OK){
    /* Starting Error */
    STM32_Error_Handler();
  }
  AZURE_PRINTF("Channel 1 for Timer 1 stopped\r\n");
}

/**
  * @brief  Function called when the Socket is closed
  * @param  uint8_t* socketID pointer to the socket handle
  * @retval None
  */
void ind_wifi_socket_client_remote_server_closed(uint8_t * socketID)
{
  if(SocketHandleAzure[AZURE_SOCKET_FOTA]==(*socketID)) {
    if(OTAStatus != OTA_STATUS_END ) {
      AZURE_PRINTF("Err: Socket for WIFI closed before full OTA Trasmission\r\n");
      OTAStatus = OTA_STATUS_ERROR;
    } else {
      SocketHandleAzure[AZURE_SOCKET_FOTA]=0xFF;
    }
  } else {
    AZURE_PRINTF("WIFI closed =%x\r\n",* socketID);
    if (NTP_Status==NTP_STATUS_CONNECTED) {
      NTP_Status = NTP_STATUS_CLOSED;
    }
  }
}

/**
 * @brief  WiFi callback for data received
 * @param  uint8_t pSocketHandle socket handle
 * @param  uint8_t * data_ptr pointer to buffer containing data received 
 * @param  uint32_t message_size number of bytes in message received
 * @param  uint32_t chunk_size numeber of bytes in chunk
 * @retval None
 */
void ind_wifi_socket_data_received(uint8_t pSocketHandle,uint8_t * data_ptr, uint32_t message_size, uint32_t chunk_size)
{
#if 0
  /* Just for Debug */
  AZURE_PRINTF("****** Received buffer for a socket...***** \r\n");
  AZURE_PRINTF("socket received =\r\n");
  AZURE_PRINTF("\tSock=%d\r\n",pSocketHandle);
  //AZURE_PRINTF("\tdata=%s\r\n",data_ptr);
  AZURE_PRINTF("\tmessage_size=%ld\r\n",message_size);
  AZURE_PRINTF("\tchunk_size=%ld\r\n",chunk_size);
#endif

  if(NTP_Status==NTP_STATUS_CONNECTED) {
    if(message_size==4){
      time_t epochTimeToSetForSystem = SynchronizationAgentConvertNTPTime2EpochTime(data_ptr,message_size);
      if (TimingSystemSetSystemTime(epochTimeToSetForSystem)== 0){
        AZURE_PRINTF("Err Failed to set system time. \r\n");
      } else {
        AZURE_PRINTF("Set UTC Time: %s\r\n",(get_ctime(&epochTimeToSetForSystem)));
      }
    }
  } else if(SocketHandleAzure[AZURE_SOCKET_FOTA]==pSocketHandle) {
    /* Secure mbedTLS socket for FOTA */
    if(LocalBufferPushBuffer(&localBufferReading[AZURE_SOCKET_FOTA], (void*) data_ptr,chunk_size)==0) {
      AZURE_PRINTF("Err: for Pushing Buffer for FOTA\r\n");
    }
  } else if(SocketHandleAzure[AZURE_SOCKET_TELEMETRY]==pSocketHandle) {
    /* Secure mbedTLS socket for Telemetry */
    if(LocalBufferPushBuffer(&localBufferReading[AZURE_SOCKET_TELEMETRY], (void*) data_ptr,chunk_size)==0) {
      AZURE_PRINTF("Err: for Pushing Buffer for Telemetry\r\n");
    }
  }
}

/**
 * @brief  WiFi callback when it is connected to Access Point
 * @param  None
 * @retval None
 */
void ind_wifi_connected()
{
  AZURE_PRINTF("WiFi connected to AccessPoint\r\n");
  wifi_state = wifi_state_connected;
}

/**
 * @brief  WiFi callback when it is initilized
 * @param  None
 * @retval None
 */
void ind_wifi_on()
{
  AZURE_PRINTF("\r\n\nwifi started and ready...\r\n");
  wifi_state = wifi_state_ready;
}

/** @brief function for providing the default TLS I/O interface
 * @param None
 * @retval IO_INTERFACE_DESCRIPTION* Pointer to the default TLS I/O interface
 */
const IO_INTERFACE_DESCRIPTION* platform_get_default_tlsio(void)
{
#ifdef USE_MBED_TLS
  return tlsio_mbedtls_get_interface_description();
#else /* USE_MBED_TLS */
  return tlsio_STM32Cube_get_interface_description();
#endif /* USE_MBED_TLS */
}

